In [1]:
import pandas as pd

In [5]:
#Creating a DataFrame with integer data
data={'Age':[25,30,26,28,20,22,40,28],
      'Salary': [50000,65000,45000,67000,32000,48000,80000,56000]}
df=pd.DataFrame(data)
df

   Age  Salary
0   25   50000
1   30   65000
2   26   45000
3   28   67000
4   20   32000
5   22   48000
6   40   80000
7   28   56000

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Age     8 non-null      int64
 1   Salary  8 non-null      int64
dtypes: int64(2)
memory usage: 260.0 bytes

In [8]:
df.dtypes

Age       int64
Salary    int64
dtype: object

In [11]:
df['Age']=df['Age'].astype('int32')
df['Salary']=df['Salary'].astype('int32')
df

   Age  Salary
0   25   50000
1   30   65000
2   26   45000
3   28   67000
4   20   32000
5   22   48000
6   40   80000
7   28   56000

In [12]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Age     8 non-null      int32
 1   Salary  8 non-null      int32
dtypes: int32(2)
memory usage: 196.0 bytes

In [13]:
df['Age']=df['Age'].astype('float64')
df['Salary']=df['Salary'].astype('float64')
df

    Age   Salary
0  25.0  50000.0
1  30.0  65000.0
2  26.0  45000.0
3  28.0  67000.0
4  20.0  32000.0
5  22.0  48000.0
6  40.0  80000.0
7  28.0  56000.0

In [14]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Age     8 non-null      float64
 1   Salary  8 non-null      float64
dtypes: float64(2)
memory usage: 260.0 bytes